# Дана строка. Преобразовать в ней все прописные (заглавные) латинские буквы в строчные (маленькие).

# -> С Позволяет Легко Выстрелить Себе в Ногу. C C++ это сделать Сложнее, но, Когда ВЫ это делаете, вы ОТСТРЕЛИВАЕТЕ себе ногу целиком
# <- с позволяет легко выстрелить себе в ногу. с с++ это сделать сложнее, но, когда вы это делаете, вы отстреливаете себе ногу целиком

Str = input("Enter string: ")
print(Str.lower())